## Production: export 💾
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 2 to add, 3 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                                               NAME                                                                |
|--------|-----------------------------------------------------------------------------------------------------------------------------------|
| add    | `module.platform_support_freshdesk_export.aws_cloudwatch_metric_alarm.platform_support_freshdesk_export_error_logged`             |
|        | `module.platform_support_freshdesk_export.aws_cloudwatch_metric_alarm.platform_support_freshdesk_export_errors`                   |
| delete | `module.platform_support_freshdesk_export.aws_cloudwatch_metric_alarm.platform_support_freshdesk_export`                          |
| update | `module.platform_support_freshdesk_export.aws_ssm_parameter.freshdesk_api_key`                                                    |
|        | `module.platform_support_freshdesk_export.module.platform_support_freshdesk_export.module.this_lambda.aws_iam_policy.policies[0]` |
|        | `module.platform_support_freshdesk_export.module.platform_support_freshdesk_export.module.this_lambda.aws_lambda_function.this`   |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.platform_support_freshdesk_export.data.aws_iam_policy_document.platform_support_freshdesk_export will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "platform_support_freshdesk_export" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "ssm:GetParameter*",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:ssm:ca-central-1:739275439843:parameter/platform/support/freshdesk-api-key",
            ]
          + sid       = "GetSSMParameters"
        }
    }

  # module.platform_support_freshdesk_export.aws_cloudwatch_metric_alarm.platform_support_freshdesk_export will be destroyed
  # (because aws_cloudwatch_metric_alarm.platform_support_freshdesk_export is not in configuration)
  - resource "aws_cloudwatch_metric_alarm" "platform_support_freshdesk_export" {
      - actions_enabled                       = true -> null
      - alarm_actions                         = [
          - "arn:aws:sns:ca-central-1:739275439843:cloudwatch-alarm-action",
        ] -> null
      - alarm_description                     = "Errors logged over 1 minute by the Platform / Support / Freshdesk export." -> null
      - alarm_name                            = "platform-support-freshdesk-export-error" -> null
      - arn                                   = "arn:aws:cloudwatch:ca-central-1:739275439843:alarm:platform-support-freshdesk-export-error" -> null
      - comparison_operator                   = "GreaterThanThreshold" -> null
      - datapoints_to_alarm                   = 0 -> null
      - dimensions                            = {} -> null
      - evaluation_periods                    = 1 -> null
      - id                                    = "platform-support-freshdesk-export-error" -> null
      - insufficient_data_actions             = [] -> null
      - metric_name                           = "platform-support-freshdesk-export-error" -> null
      - namespace                             = "data-lake" -> null
      - ok_actions                            = [
          - "arn:aws:sns:ca-central-1:739275439843:cloudwatch-ok-action",
        ] -> null
      - period                                = 60 -> null
      - statistic                             = "Sum" -> null
      - tags                                  = {} -> null
      - tags_all                              = {
          - "CostCentre" = "PlatformDataLake"
          - "Terraform"  = "true"
        } -> null
      - threshold                             = 0 -> null
      - treat_missing_data                    = "notBreaching" -> null
        # (4 unchanged attributes hidden)
    }

  # module.platform_support_freshdesk_export.aws_cloudwatch_metric_alarm.platform_support_freshdesk_export_error_logged will be created
  + resource "aws_cloudwatch_metric_alarm" "platform_support_freshdesk_export_error_logged" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:739275439843:cloudwatch-alarm-action",
        ]
      + alarm_description                     = "Errors logged over 1 minute by the Platform / Support / Freshdesk export."
      + alarm_name                            = "platform-support-freshdesk-export-error-logged"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "platform-support-freshdesk-export-error"
      + namespace                             = "data-lake"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:739275439843:cloudwatch-ok-action",
        ]
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # module.platform_support_freshdesk_export.aws_cloudwatch_metric_alarm.platform_support_freshdesk_export_errors will be created
  + resource "aws_cloudwatch_metric_alarm" "platform_support_freshdesk_export_errors" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:739275439843:cloudwatch-alarm-action",
        ]
      + alarm_description                     = "Errors metric over 1 minute by the Platform / Support / Freshdesk export."
      + alarm_name                            = "platform-support-freshdesk-export-errors"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Errors"
      + namespace                             = "AWS/Lambda"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:739275439843:cloudwatch-ok-action",
        ]
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # module.platform_support_freshdesk_export.aws_ssm_parameter.freshdesk_api_key will be updated in-place
  ~ resource "aws_ssm_parameter" "freshdesk_api_key" {
        id              = "/platform/support/freshdesk-api-key"
      + insecure_value  = (known after apply)
        name            = "/platform/support/freshdesk-api-key"
        tags            = {}
      ~ value           = (sensitive value)
      ~ version         = 2 -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # module.platform_support_freshdesk_export.module.platform_support_freshdesk_export.module.this_lambda.aws_iam_policy.policies[0] will be updated in-place
  ~ resource "aws_iam_policy" "policies" {
        id               = "arn:aws:iam::739275439843:policy/platform-support-freshdesk-export-0"
        name             = "platform-support-freshdesk-export-0"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "ssm:GetParameter*"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ssm:ca-central-1:739275439843:parameter/platform/support/freshdesk-api-key"
                      - Sid      = "GetSSMParameters"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "CostCentre" = "PlatformDataLake"
            "Terraform"  = "true"
        }
        # (7 unchanged attributes hidden)
    }

  # module.platform_support_freshdesk_export.module.platform_support_freshdesk_export.module.this_lambda.aws_lambda_function.this will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "platform-support-freshdesk-export"
        tags                           = {
            "CostCentre" = "PlatformDataLake"
            "Terraform"  = "true"
        }
      ~ timeout                        = 300 -> 15
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 2 to add, 3 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["module.platform_support_freshdesk_export.aws_cloudwatch_metric_alarm.platform_support_freshdesk_export_error_logged"]
WARN - plan.json - main - Missing Common Tags: ["module.platform_support_freshdesk_export.aws_cloudwatch_metric_alarm.platform_support_freshdesk_export_errors"]
WARN - plan.json - main - Missing Common Tags: ["module.platform_support_freshdesk_export.aws_ssm_parameter.freshdesk_api_key"]

22 tests, 19 passed, 3 warnings, 0 failures, 0 exceptions

```

</details>
